In [ ]:
# what is 'dataframe' in pandas and how is it different from pandas.series?

In [ ]:
DataFrame is a structure that contains two-dimensional data and its corresponding labels.
DataFrames are widely used in data science, machine learning, scientific computing, and many other data-intensive fields.
DataFrames are similar to SQL tables or the spreadsheets that you work with in Excel

In [ ]:
Series can only contain single list with index, whereas dataframe can be made of more than one series or
we can say that a dataframe is a collection of series that can be used to analyse the data.

In [ ]:
# what are some common functions you can use to manipulate data in a pandas data
frames? can you give an example of when you might use one of these functions?

In [ ]:
1.Read From and Write to Excel or CSV in pandas 
2.Get the Mean, Median, and Mode
3.Df.transform
4.df.head
5.df.loc
6.df.describe()
7.df.replace
8.df.dtypes

In [5]:
import pandas as pd

In [6]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
#which of the following is mutable in nature in nature series,dataframe,panel ?

In [ ]:
panel and data frames are mutable in nature because we can modified .

In [ ]:
# create a dataframe using multiple series.explain with an example

In [9]:
import pandas as pd
 

author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti']
article = [210, 211, 114, 178]

auth_series = pd.Series(author)
article_series = pd.Series(article)

frame = { 'Author': auth_series, 'Article': article_series }

result = pd.DataFrame(frame)

print(result)

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

In [ ]:
# create a pandas series that contains the following data : 4,8,15,16,23,42. then print the series.

In [1]:
import pandas as pd

In [4]:
s = pd.Series([4,8,15,16,23,42])

In [5]:
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
# create a variable of list type containing 10 elements in it,and apply pandas.series function on the variable print it.

In [7]:
import pandas as pd

In [11]:
s1 = pd.Series(['a','b','c','d','e','f','g','h','i','j'])

In [12]:
s1

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

In [ ]:
# create a pandas data frame that contains the data

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame({"Name":['alice','bob','claire'],
              "age":[25,30,27],
              "gender":['female','male','male']
})

In [10]:
df

     Name  age  gender
0   alice   25  female
1     bob   30    male
2  claire   27    male